### Task 1

In [1]:
import pandas as pd

df = pd.DataFrame({
    "Toys": ["ball", "doll", "car", "block"],
    "Price": [10, 20, 15, 5],
    "Stock": [50, 30, 40, 100]
})

In [2]:
df.head(2)

   Toys  Price  Stock
0  ball     10     50
1  doll     20     30

In [3]:
df.tail(2)

    Toys  Price  Stock
2    car     15     40
3  block      5    100

In [7]:
df.loc[2:]

    Toys  Price  Stock
2    car     15     40
3  block      5    100

In [6]:
df["Price"]
# it will return a series

0    10
1    20
2    15
3     5
Name: Price, dtype: int64

### Task 2

In [8]:
df

    Toys  Price  Stock
0   ball     10     50
1   doll     20     30
2    car     15     40
3  block      5    100

In [13]:
# label-based access

df.loc[1, ["Toys", "Price"]]

Toys     doll
Price      20
Name: 1, dtype: object

In [15]:
# position-based access

df.iloc[1,0]

'doll'

In [16]:
# slicing with .loc

df.loc[1:, "Toys"]

1     doll
2      car
3    block
Name: Toys, dtype: object

### Task 3

In [21]:
# average

avg_price = df["Price"].mean()
print(avg_price)

12.5

In [24]:
# adding a new column

df["Value"] = df["Price"] * df["Stock"]
df

    Toys  Price  Stock  Value
0   ball     10     50    500
1   doll     20     30    600
2    car     15     40    600
3  block      5    100    500

In [25]:
# simple filtering

df_prices = pd.DataFrame({
    'Toy': ['Ball', 'Car', 'Doll', 'Train'],
    'Price': [10.0, 20.0, 30.0, 45.0]
})

df_stock = pd.DataFrame({
    'Toy': ['Ball', 'Car', 'Doll', 'Robot'],
    'Stock': [50, 40, 30, 10]
})

### Task 4

In [27]:
pd.merge(df_prices, df_stock, how = "inner")

    Toy  Price  Stock
0  Ball   10.0     50
1   Car   20.0     40
2  Doll   30.0     30

In [28]:
# outer merge

pd.merge(df_prices, df_stock, how = "outer")

     Toy  Price  Stock
0   Ball   10.0   50.0
1    Car   20.0   40.0
2   Doll   30.0   30.0
3  Robot    NaN   10.0
4  Train   45.0    NaN

In [32]:
df_a = pd.DataFrame({'A': [1, 3], 'B': [2, 5]})
df_b = pd.DataFrame({'C': [4, 7], 'D': [5, 12]})

pd.concat([df_a, df_b], axis = 1)

   A  B  C   D
0  1  2  4   5
1  3  5  7  12